#+Title: Container p/ C/C++ Development

*** projeto c++_projeexample
    

Agora, vamos compilar um  um helloworld.cpp

#+NAME:./bin/g++.sh
#+BEGIN_SRC shell :session s1 :results output :exports both :post parseShellAnsiColorCharacters(data=*this*)
  projDir=/home/wagner/fzlbpms/submodules/ansible-artifacts/playbook-container-docker-cc++/example_projects/c++_projexample
  cd $projDir
  echo "###--> Listando arquivos do projeto..."
  ls -ilha
  echo "###--> Compilando o arquivo helloworld.cpp"
  ./g++.sh helloworld.cpp 
  echo "###--> Listando novamente arqs do projeto"
  ls -ilha
#+END_SRC

#+RESULTS: ./bin/g++.sh
#+begin_example

 [wagner@wagner-Insp153567 c++_projexample]$ ###--> Listando arquivos do projeto...
 total 16K
48104641 drwxr-xr-x 2 wagner wagner 4,0K abr  3 14:15 .
48104451 drwxr-xr-x 4 wagner wagner 4,0K abr  3 12:53 ..
48104619 -rwxr-xr-x 1 wagner wagner  129 abr  3 14:01 g++.sh
48104644 -rw-r--r-- 1 wagner wagner   95 jan 31 14:57 helloworld.cpp
 ###--> Compilando o arquivo helloworld.cpp
 [wagner@wagner-Insp153567 c++_projexample]$ ###--> Listando novamente arqs do projeto
 total 36K
48104641 drwxr-xr-x 2 wagner wagner 4,0K abr  3 14:15 .
48104451 drwxr-xr-x 4 wagner wagner 4,0K abr  3 12:53 ..
48104623 -rwxr-xr-x 1 wagner wagner  17K abr  3 14:15 a.out
48104619 -rwxr-xr-x 1 wagner wagner  129 abr  3 14:01 g++.sh
48104644 -rw-r--r-- 1 wagner wagner   95 jan 31 14:57 helloworld.cpp
#+end_example

